interface Kana {
   MONO: string[][]
}

export const HIRAGANA: Kana = {
   MONO: [
      ['あ', 'い', 'う', 'え', 'お'], // ∅
      ['か', 'き', 'く', 'け', 'こ'], // K
      ['さ', 'し', 'す', 'せ', 'そ'], // S
      ['た', 'ち', 'つ', 'て', 'と'], // T
      ['な', 'に', 'ぬ', 'ね', 'の'], // N
      ['ま', 'み', 'む', 'め', 'も'], // H
      ['は', 'ひ', 'ふ', 'へ', 'ほ'], // M
      ['や', '', 'ゆ', '', 'よ'], // Y
      ['ら', 'り', 'る', 'れ', 'ろ'], // R
      ['わ', '', '', '', 'を'], // W
      ['ん'], // n
   ],
}

export const KATAKANA: Kana = {
   MONO: [
      ['ア', 'イ', 'ウ', 'エ', 'オ'], // ∅
      ['カ', 'キ', 'ク', 'ケ', 'コ'], // K
      ['サ', 'シ', 'ス', 'セ', 'ソ'], // S
      ['タ', 'チ', 'ツ', 'テ', 'ト'], // T
      ['ナ', 'ニ', 'ヌ', 'ネ', 'ノ'], // N
      ['ハ', 'ヒ', 'フ', 'ヘ', 'ホ'], // H
      ['マ', 'ミ', 'ム', 'メ', 'モ'], // M
      ['ヤ', '', 'ユ', '', 'ヨ'], // Y
      ['ラ', 'リ', 'ル', 'レ', 'ロ'], // R
      ['ワ', '', '', '', 'ヲ', 'ン'], // W
      ['ン'], // n
   ],
}
